'''
Messages for 'main' module
'''
start_message = 'Рады приветствовать вас!\nУ нас вы можете обменять валюту онлайн.\n\n\
Для получения справки воспользуйтесь соответствующей кнопкой ниже.'
start_help_message = 'Тут будет справка о правилах пользования сервисом на стартовом экране'
start_work_mode_info = 'Тут информация о режиме работы'


'''
Messages for 'exchange' module
'''
set_sell_currency = 'Начинаем обмен!'
currency_choice_1 = 'Какую валюту вы хотите продать?'
enter_amount = 'Введите сумму которую хотите обменять'
enter_rate = 'Укажите желаемый курс, по которому вы бы хотели произвести обмен.\n\n\
Либо введите 0 если желаемого курса нет.'
request_is_open = 'Ваша заявка принята.\n\nОжидайте предложений.'
enter_bank_account = 'Введите номер телефона к которому привязана ваша карта, либо номер карты.'
end_message = 'Операция успешно завершена.\nСпасибо за ваше доверие!'



'''
Messages for 'admin' module
'''




'''
Messages for 'changers' module
'''
decline_message = 'Запрос отменен.'
chr_enter_rate = 'Укажите курс, по которому готовы произвести обмен:'
chr_choose_bank = 'Выберите банк, на который готовы принять деньги от пользователя'
chr_send_response = 'Ваш ответ отправлен пользователю'