'''
Messages for 'main' module
'''
start_message = 'Рады приветствовать вас!\nУ нас вы можете обменять валюту онлайн.\n\n\
Для получения справки воспользуйтесь соответствующей кнопкой ниже.'
start_help_message = 'Тут будет справка о правилах пользования сервисом на стартовом экране'
start_work_mode_info = 'Тут информация о режиме работы'
staff_hello = 'Добро пожаловать!'
staff_404 = 'Вход разрешен только сотрудникам'
staff_else = 'Что-то пошло не так. Свяжитесь с администратором'


'''
Messages for 'user' module
'''
zero_offer = 'К сожалению, сейчас нет предложений для обмена по выбранной вами валюте'
set_sell_currency = 'Начинаем обмен!'
currency_choice_1 = 'Какую валюту вы хотите продать?'
type_error_msg = 'Вы ввели некорректное значение. Корректный пример: 25000'
enter_user_bank_name = '🏦 Введите название банка, куда вы ходите получить 💸 MNT за проданную валюту: 👇'




'''
Messages for 'admin' module
'''




'''
Messages for 'changers' module
'''
decline_message = 'Запрос отменен.'
chr_enter_rate = 'Укажите курс, по которому готовы произвести обмен:'
chr_choose_bank = 'Выберите банк, на который готовы принять деньги от пользователя'
chr_send_response = 'Ваш ответ отправлен пользователю'